/* RuleEditorController */
"%@ (Disabled: %@)" = "%1$@ (مُعطّل: %2$@)";

/* SettingsViewController */
"About" = "عن الخدمة";

/* BookmarkViewController */
"Add Bookmark" = "زيادة علامة مرجعيّة ";

/* RuleEditorController */
"All rules" = "جميع القواعد ";

/* SettingsViewController */
"Allow 3rd-Party Keyboards" = "السماح للوحات مفاتيح من طرف ثالث";

/* SecurityViewController */
"Allow hosts to permanently store cookies and local storage databases." = "السماح للمضيفين بتخزين ملفات تعريف الارتباط وقواعد بيانات التخزين المحلية بشكل دائم";

/* SecurityViewController */
"Allow HTTPS hosts to load page resources from non-HTTPS hosts. (Useful for RSS readers and other aggregators.)" = "السماح لمضيفي HTTPS بتحميل موارد الصفحة من مضيفات غير HTTPS (مفيدة لقُرَّاء RSS والمُجمِّعات الأخرى)";

/* SecurityViewController */
"Allow Persistent Cookies" = "السماح بملفات تعريف الارتباط الدائمة";

/* Tab+UIWebViewDelegate */
"Allow this page to close its tab?" = "هل تريدون السماح لهذه الصفحة بإغلاق التبويبة الخاصة بها؟";

/* Tab+Gestures */
"An error occurred downloading image %@" = "حدث خطأ أثناء تنزيل الصورة %@";

/* AppDelegate */
"Authentication Required" = "مطلوب التوثيق";

/* URLBlockerRuleController */
"Blocked 3rd-Party Hosts" = "تم حظر مضيفو الجهات الخارجية  من طرف ثالث";

/* BookmarksViewController */
"Bookmarks" = "الإشارات المرجعية";

/* CircuSitsViewController */
"Bridge Configuration" = "تكوين الجِسْر";

/* DonationViewController */
"Cancel" = "إلغاء ";

/* SettingsViewController */
"Changing this option requires restarting the app." = "تغيير هذا الخيار يتطلّب إعادة تشغيل التطبيق ";

/* AppDelegate */
"Close Tab" = "إغلاق التبويبة ";

/* Tab+UIWebViewDelegate */
"Confirm" = "تأكيد ";

/* SecurityViewController */
"Content Policy" = "سياسة المحتوى ";

/* SettingsViewController, Storage1ViewController, Storage2ViewController */
"Cookies and Local Storage" = "ملفات تعريف الارتباط والتخزين المحلي";

/* Storage1ViewController */
"Cookies and local storage data from non-whitelisted hosts will be cleared even from open tabs after not being accessed for this many minutes." = "سيتم إزلة بيانات ملفّات الرّبط والتخزين المحلّي من المستضيفين الغير موجودين في القائمة البيضاء، حتّى من التبويبات المفتوحة بعد عدم قدرة الوصول إليها لهذا المدّة من الدّقائق ";

/* Tab+Gestures */
"Copy URL" = "نسخ الرّابط ";

/* AppDelegate */
"Create New Tab" = "إنشاء تبويبة جديدة ";

/* SecurityViewController */
"Custom user-agent string, or blank to use the default." = "سلسلة وكيل المستخدم المخصّصة، أو فارغ لإستخدام الافتراضي";

/* HostSettings */
"Default Settings" = "الإعدادات الافتراضيّة ";

/* RuleEditorController */
"Disable" = "تعطيل";

/* RuleEditorController */
"Disabled: %@" = "مُعطّل: %@";

/* DonationViewController */
"Donate" = "تبرَّع";

/* BrowsingViewController */
"Done" = "انتهى";

/* BookmarkViewController */
"Edit Bookmark" = "تعديل العلامة المرجعيّة";

/* RuleEditorController */
"Enable" = "تفعيل ";

/* Tab+Gestures, Tab+UIWebViewDelegate */
"Error" = "خطأ";

/* AppDelegate */
"Focus URL Field" = "تركيز حقل الرابط";

/* AppDelegate */
"Go Back" = "العودة للخلف";

/* AppDelegate */
"Go Forward" = "الذهاب للأمام";

/* SettingsViewController */
"HTTPS Everywhere" = "HTTPS Everywhere";

/* HTTPSEverywhereRuleController */
"HTTPS Everywhere Rules" = "قواعد HTTPS Everywhere";

/* AppDelegate */
"Log In" = "تسجيل الدخول";

/* SettingsViewController */
"Minimum version of TLS required for hosts to negotiate HTTPS connections." = "الحد الأدنى للإصدار المطلوب من TLS من قبل المضيفين للتفاوض على إتصالات HTTPS";

/* SettingsViewController */
"Miscellaneous" = "متفرّقات ";

/* SecurityViewController */
"No XHR/WebSocket/Video connections" = "بدون إتصالات XHR/WebSocket/Video";

/* JAHPAuthenticatingHTTPProtocol, Tab+Gestures, Tab+UIWebViewDelegate, DonationViewController */
"OK" = "موافق/ة";

/* Tab+Gestures */
"Open" = "فتح";

/* SecurityViewController */
"Open (normal browsing mode)" = "فتح (وضع التصفّح العادي)";

/* Tab+Gestures */
"Open in a New Tab" = "فتح في تبويبه جديدة";

/* Tab+Gestures */
"Open in Safari" = "فتح في سفاري";

/* SecurityViewController */
"Other" = "آخر";

/* AppDelegate */
"Password" = "كلمة السر";

/* SecurityViewController */
"Privacy" = "الخصوصية";

/* Tab */
"Pull to Refresh Page" = "اسحب/ي لتحديث الصفحة";

/* SettingsViewController */
"Rate on App Store" = "التقييم على الآب ستور";

/* SettingsViewController */
"Report a Bug" = "\"بلّغوا عن خلل";

/* SecurityViewController */
"Restrictions on resources loaded from web pages." = "قيود على الموارد المحمّلة من صفحات الويب";

/* RuleEditorController */
"Rules in use on current page" = "القواعد المستخدمة في الصفحة الحالية";

/* Tab+Gestures */
"Save Image" = "حفظ الصورة";

/* SettingsViewController */
"Search" = "بحث";

/* SettingsViewController */
"Search Engine" = "محرّك بحث ";

/* SettingsViewController */
"Send Do-Not-Track Header" = "إرسال ترويسة طلب-عدم-التتّبّع ";

/* SettingsViewController */
"Settings" = "الإعدادات";

/* AppDelegate */
"Show Bookmarks" = "عرض الإشارات المرجعية";

/* SecurityViewController */
"Strict (no JavaScript, video, etc.)" = "صارم (بدون JavaScript، فيديو، إلخ.)";

/* SettingsViewController */
"Support" = "الدعم الفني";

/* AppDelegate */
"Switch to Tab %d" = "التبديل إلى التبويبه %d";

/* SettingsViewController */
"TLS Version" = "إصدار TLS";

/* AddSiteViewController */
"URL" = "الرابط";

/* SettingsViewController */
"URL Blocker" = "مانع الروابط";

/* SecurityViewController */
"User Agent" = "وكيل المستخدم/ة";

/* RuleEditorController */
"User disabled" = "المستخدم/ة مُعطّل/ة";

/* SecurityViewController */
"WebRTC" = "WebRTC";

/* DonationViewController */
"__DONATE_EXPLANATION_PARAGRAPH1__" = "Onion Browser is a free app, but it takes time and resources to develop and maintain.";

/* DonationViewController */
"__DONATE_EXPLANATION_PARAGRAPH2__" = "You can support the app by sending a small tip through an in-app purchase, below. This is a one-time, non-recurring transaction, but you can come back any time to send another. No information about your in-app purchase is collected or stored by the Onion Browser developers.";

/* DonationViewController */
"__DONATE_EXPLANATION_PARAGRAPH3__" = "You can learn about other ways to help (including Patreon, PayPal, Bitcoin, or Zcash) in the 'About' section of the 'Settings' page.";

/* DonationViewController */
"__DONATE_THANKS__" = "Thank you! Every little bit helps! Your payment of %@ helps ensure continuing development on Onion Browser and tools that make Tor easier to integrate into other iOS apps.";
